Tekla Open API Reference for Tekla Structures 2025
EdgeEnumerator Class
 The EdgeEnumerator class is used to enumerate the edges of a solid.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Solid.EdgeEnumerator
 Namespace: Tekla.Structures.Solid
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class EdgeEnumerator : IEnumerator
Public NotInheritable Class EdgeEnumerator
	Implements IEnumerator
The EdgeEnumerator type exposes the following members.
Properties
Name | Description
Current
 Gets the current edge.
Top
Methods
Name | Description
MoveNext
 Moves to the next item in the enumerator.
Reset
 Resets the enumerator to the beginning.
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Solid;
using Tekla.Structures.Geometry3d;
public class Example
{
    public void Example1()
    {
        ModelObjectEnumerator myEnum = new Model().GetModelObjectSelector().GetAllObjectsWithType(new Type[] { typeof(Part) });
        while (myEnum.MoveNext())
        {
            try
            {
                Part part = myEnum.Current as Part;
                if (part != null)
                {
                    Console.WriteLine("Part id: " + part.Identifier.ID.ToString());
                    Solid solid = part.GetSolid();
                    if (solid != null)
                    {
                        EdgeEnumerator edgeEnumerator = solid.GetEdgeEnumerator();
                        int edgeCount = 0;
                        while (edgeEnumerator.MoveNext())
                        {
                            var edge = edgeEnumerator.Current as Edge;
                            if (edge != null)
                            {
                                Console.WriteLine("Start : " + edge.StartPoint.ToString());
                                Console.WriteLine("End : " + edge.EndPoint.ToString());
                                Console.WriteLine("Type : " + edge.Type.ToString());
                                edgeCount++;
                            }
                        }
                        Console.WriteLine("Edge count : " + edgeCount.ToString());
                    }
                }
            }
            catch { }
        }
    }
}
See Also
Reference
Tekla.Structures.Solid Namespace